In [434]:
import re
import pandas as pd
from pandas.io.json import json_normalize
import numpy as np
import requests

# you must populate this dict with the schools required -> try talking to the teaching team about this

schools = {   
    'flatiron-school' : 10748,
    'general-assembly' :10761,
    'data-science-dojo' : 10685,
    'ironhack' : 10828,
    'le-wagon' : 10868,
    'wild-code-school' : 11169,
    'the-dev-masters' : 11077,
    'byte-academy' : 10574,
    'the-data-incubator' : 11074,
    "brainstation" : 10571,
    }

def get_comments_school(school):
    TAG_RE = re.compile(r'<[^>]+>')
    # defines url to make api call to data -> dynamic with school if you want to scrape competition
    url = "https://www.switchup.org/chimera/v1/school-review-list?mainTemplate=school-review-list&path=%2Fbootcamps%2F" + school + "&isDataTarget=false&page=3&perPage=10000&simpleHtml=true&truncationLength=250"
    #makes get request and converts answer to json
    # url defines the page of all the information, request is made, and information is returned to data variable
    data = requests.get(url).json()
    #converts json to dataframe
    reviews =  pd.DataFrame(data['content']['reviews'])

  
    #aux function to apply regex and remove tags
    def remove_tags(x):
        return TAG_RE.sub('',x)
    reviews['review_body'] = reviews['body'].apply(remove_tags)
    reviews['school'] = school
    return reviews

In [435]:
# could you write this as a list comprehension?
# comments = [comments.append(get_comments_school(school)) for school in schools.keys()]

comments = []

for school in schools.keys():
    print(school)
    comments.append(get_comments_school(school))

comments = pd.concat(comments)

flatiron-school
general-assembly
data-science-dojo
ironhack
le-wagon
wild-code-school
the-dev-masters
byte-academy
the-data-incubator
brainstation

In [436]:
comments.head(2)

,id,name,anonymous,hostProgramName,graduatingYear,isAlumni,jobTitle,tagline,body,rawBody,...,queryDate,program,user,overallScore,comments,overall,curriculum,jobSupport,review_body,school
0,297686,Anonymous,True,None,2021.0,False,Software Engineer,Waste of time. They want your money.,"<span class=""truncatable""><p></p><p>I found my...",<p>I found my therapist through Flatiron. That...,...,2023-02-07,Online Software Engineering,{'image': None},1.3,[],1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,flatiron-school
1,290538,Anonymous,True,None,2020.0,False,,Negative experience,"<span class=""truncatable""><p></p><p>I have a m...",<p>I have a money-back guarantee with them for...,...,2022-07-09,None,{'image': None},1.7,[],2.0,2.0,1.0,I have a money-back guarantee with them for jo...,flatiron-school

In [438]:
comments.drop(['anonymous', 'hostProgramName', 'body', 'rawBody', 'user', 'comments', 'overallScore','queryDate' ], axis=1, inplace = True, errors='ignore')

In [439]:
comments.head()

,id,name,graduatingYear,isAlumni,jobTitle,tagline,createdAt,program,overall,curriculum,jobSupport,review_body,school
0,297686,Anonymous,2021.0,False,Software Engineer,Waste of time. They want your money.,2/7/2023,Online Software Engineering,1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,flatiron-school
1,290538,Anonymous,2020.0,False,,Negative experience,7/9/2022,None,2.0,2.0,1.0,I have a money-back guarantee with them for jo...,flatiron-school
2,288383,Anonymous,2021.0,False,Data Scientist,Great learning Experience,5/2/2022,Online Data Science,5.0,5.0,5.0,I had a great learning experience at Flatiron ...,flatiron-school
3,286189,Yeva Usatova,2022.0,False,Software engineer part time,The worst place ever,2/24/2022,,1.0,1.0,1.0,If you are working full time and looking for a...,flatiron-school
4,285483,Lisa Arends,2021.0,False,Data Analyst II,Empowering and Life-Changing,1/31/2022,Online Data Science,5.0,5.0,5.0,"After teaching math for 20 years, I decided th...",flatiron-school

In [440]:
comments.rename(columns  = {'id' : 'comment_id', 'name' : 'student_name', 'graduatingYear' : 'graduation_year', 'isAlumni': 'alumni', 'jobTitle' : 'job_title', 'tagline' : 'review_tag', 'createdAt' : 'review_date', 'overall':'overall_rating', 'curriculum': 'course_rating', 'jobSupport': 'support_rating', 'review_body' : 'comment'}, inplace = True)

In [442]:

comments['graduation_year'] = comments.graduation_year.apply(np.round).astype("Int64")

In [447]:
comments.head(2)

,comment_id,student_name,graduation_year,alumni,job_title,review_tag,review_date,program,overall_rating,course_rating,support_rating,comment,school
0,297686,Anonymous,2021,False,Software Engineer,Waste of time. They want your money.,2/7/2023,Online Software Engineering,1.0,2.0,1.0,I found my therapist through Flatiron. That's ...,flatiron-school
1,290538,Anonymous,2020,False,,Negative experience,7/9/2022,None,2.0,2.0,1.0,I have a money-back guarantee with them for jo...,flatiron-school

In [448]:
import mysql.connector

In [449]:
# Import module
import pymysql
import getpass  # to view password print the password
password= getpass.getpass()

In [450]:
#  establishing a connection to a database --> group of tables
cnx = mysql.connector.connect(user ='root',
                             password = password,
                             host = 'localhost',
                             database = 'project',
                             auth_plugin = 'mysql_native_password')

In [451]:
# check if the connection was successful
cnx.is_connected()

True

In [498]:
# import the module
from sqlalchemy import create_engine

# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw= password,
                               db="project"))

In [499]:
cursor = cnx.cursor()
cursor

In [500]:
query = ('''CREATE DATABASE project IF NOT EXISTS;''')

In [460]:
# export DataFrame comments to SQL
comments.to_csv("comments.csv")
comments.to_sql("comments", engine, if_exists = 'replace', index = False)

5798

In [475]:
from pandas import json_normalize

def get_school_info(school, school_id):
    url = 'https://www.switchup.org/chimera/v1/bootcamp-data?mainTemplate=bootcamp-data%2Fdescription&path=%2Fbootcamps%2F'+ str(school) + '&isDataTarget=false&bootcampId='+ str(school_id) + '&logoTag=logo&truncationLength=250&readMoreOmission=...&readMoreText=Read%20More&readLessText=Read%20Less'

    data = requests.get(url).json()

    data.keys()

    courses = data['content']['courses']
    courses_df = pd.DataFrame(courses, columns= ['courses'])

    locations = data['content']['locations']
    locations_df = json_normalize(locations)

    badges_df = pd.DataFrame(data['content']['meritBadges'])
    
    website = data['content']['webaddr']
    description = data['content']['description']
    logoUrl = data['content']['logoUrl']
    school_df = pd.DataFrame([website,description,logoUrl]).T
    school_df.columns =  ['website','description','LogoUrl']

    locations_df['school'] = school
    courses_df['school'] = school
    badges_df['school'] = school
    school_df['school'] = school
    

    locations_df['school_id'] = school_id
    courses_df['school_id'] = school_id
    badges_df['school_id'] = school_id
    school_df['school_id'] = school_id

    return locations_df, courses_df, badges_df, school_df

locations_list = []
courses_list = []
badges_list = []
schools_list = []

for school, id in schools.items():
    print(school)
    a,b,c,d = get_school_info(school,id)
    
    locations_list.append(a)
    courses_list.append(b)
    badges_list.append(c)
    schools_list.append(d)

flatiron-school
general-assembly
data-science-dojo
ironhack
le-wagon
wild-code-school
the-dev-masters
byte-academy
the-data-incubator
brainstation

In [476]:
locations_list

[      id        description  country.id    country.name country.abbrev  \
 0  15743  New York City, NY         1.0   United States             US
 1  16257             Online         NaN             NaN            NaN
 2  16761         Denver, CO         1.0   United States             US
 3  16958    London, England        11.0  United Kingdom             GB

    state.id state.name state.abbrev state.keyword  city.id city.name  \
 0      34.0   New York           NY      new-york   1507.0       NYC
 1       1.0     Online       Online        online      NaN       NaN
 2       7.0   Colorado           CO      colorado     27.0    Denver
 3       NaN        NaN          NaN           NaN  31176.0    London

     city.keyword           school  school_id
 0  new-york-city  flatiron-school      10748
 1            NaN  flatiron-school      10748
 2         denver  flatiron-school      10748
 3         london  flatiron-school      10748  ,
       id        description  country.id   country.name country.abbrev  \
 0  16360  New York City, NY         1.0  United States             US
 1  16372             Online         NaN            NaN            NaN

    state.id state.name state.abbrev state.keyword  city.id city.name  \
 0        34   New York           NY      new-york   1507.0       NYC
 1         1     Online       Online        online      NaN       NaN

     city.keyword            school  school_id
 0  new-york-city  general-assembly      10761
 1            NaN  general-assembly      10761  ,
       id                       description  country.id   country.name  \
 0  15968        Seattle, WA, United States         1.0  United States
 1  15995     Washington, DC, United States         1.0  United States
 2  16101         Austin, TX, United States         1.0  United States
 3  16103  New York City, NY, United States         1.0  United States
 4  16737                  Barcelona, Spain        12.0          Spain
 5  16740              Singapore, Singapore        56.0      Singapore
 6  17042    Albuquerque, NM, United States         1.0  United States
 7  17235                            Online         NaN            NaN

   country.abbrev  state.id            state.name state.abbrev  \
 0             US      49.0            Washington           WA
 1             US      10.0  District of Columbia           DC
 2             US      45.0                 Texas           TX
 3             US      34.0              New York           NY
 4             ES       NaN                   NaN          NaN
 5             SG       NaN                   NaN          NaN
 6             US      33.0            New Mexico           NM
 7            NaN       1.0                Online       Online

           state.keyword  city.id        city.name   city.keyword  \
 0            washington     97.0          Seattle        seattle
 1  district-of-columbia    775.0  Washington D.C.  washington-dc
 2                 texas     84.0           Austin         austin
 3              new-york   1507.0              NYC  new-york-city
 4                   NaN  31170.0        Barcelona      barcelona
 5                   NaN  31154.0        Singapore      singapore
 6            new-mexico     63.0      Albuquerque    albuquerque
 7                online      NaN              NaN            NaN

               school  school_id
 0  data-science-dojo      10685
 1  data-science-dojo      10685
 2  data-science-dojo      10685
 3  data-science-dojo      10685
 4  data-science-dojo      10685
 5  data-science-dojo      10685
 6  data-science-dojo      10685
 7  data-science-dojo      10685  ,
       id               description  country.id   country.name country.abbrev  \
 0  15901           Berlin, Germany        57.0        Germany             DE
 1  16022       Mexico City, Mexico        29.0         Mexico             MX
 2  16086    Amsterdam, Netherlands        59.0    Netherlands             NL
 3  16088         Sao Paulo, Brazil        42.0         Brazil             BR
 4  16109             Paris, France        38.0         France             FR
 5  16375  Miami, FL, United States         1.0  United States             US
 6  16376             Madrid, Spain        12.0          Spain             ES
 7  16377          Barcelona, Spain        12.0          Spain             ES
 8  16709          Lisbon, Portugal        28.0       Portugal             PT
 9  17233                    Online         NaN            NaN            NaN

    city.id    city.name city.keyword  state.id state.name state.abbrev  \
 0  31156.0       Berlin       berlin       NaN        NaN          NaN
 1  31175.0  Mexico City  mexico-city       NaN        NaN          NaN
 2  31168.0    Amsterdam    amsterdam       NaN        NaN          NaN
 3  31121.0    Sao Paulo    sao-paulo       NaN        NaN          NaN
 4  31136.0        Paris        paris       NaN        NaN          NaN
 5     31.0        Miami        miami      11.0    Florida           FL
 6  31052.0       Madrid       madrid       NaN        NaN          NaN
 7  31170.0    Barcelona    barcelona       NaN        NaN          NaN
 8  31075.0       Lisbon       lisbon       NaN        NaN          NaN
 9      NaN          NaN          NaN       1.0     Online       Online

   state.keyword    school  school_id
 0           NaN  ironhack      10828
 1           NaN  ironhack      10828
 2           NaN  ironhack      10828
 3           NaN  ironhack      10828
 4           NaN  ironhack      10828
 5       florida  ironhack      10828
 6           NaN  ironhack      10828
 7           NaN  ironhack      10828
 8           NaN  ironhack      10828
 9        online  ironhack      10828  ,
        id                  description  country.id          country.name  \
 0   15803         Melbourne, Australia        20.0             Australia
 1   15904          Casablanca, Morocco        44.0               Morocco
 2   15906      Buenos Aires, Argentina        60.0             Argentina
 3   15964            Brussels, Belgium        46.0               Belgium
 4   16039          Mexico City, Mexico        29.0                Mexico
 5   16049       Amsterdam, Netherlands        59.0           Netherlands
 6   16106            Sao Paulo, Brazil        42.0                Brazil
 7   16124             Barcelona, Spain        12.0                 Spain
 8   16145             Bordeaux, France        38.0                France
 9   16147                Lille, France        38.0                France
 10  16148             Lisbon, Portugal        28.0              Portugal
 11  16149              Bali, Indonesia        35.0             Indonesia
 12  16150               Nantes, France        38.0                France
 13  16274      Rio de Janeiro , Brazil        42.0                Brazil
 14  16275            Marseille, France        38.0                France
 15  16282             Montreal, Canada         2.0                Canada
 16  16283              Shanghai, China        15.0                 China
 17  16407                 Tokyo, Japan        48.0                 Japan
 18  16408                 Lyon, France        38.0                France
 19  16765              Berlin, Germany        57.0               Germany
 20  16767                Paris, France        38.0                France
 21  16776        Lausanne, Switzerland        32.0           Switzerland
 22  16800                Madrid, Spain        12.0                 Spain
 23  16805               Rennes, France        38.0                France
 24  16936         Singapore, Singapore        56.0             Singapore
 25  16967              London, England        61.0               England
 26  17314  Dubai, United Arab Emirates        34.0  United Arab Emirates
 27  17395              Munich, Germany        57.0               Germany
 28  17476              Santiago, Chile        22.0                 Chile
 29  17765                 Nice, France        38.0                France
 30  17772             Cologne, Germany        57.0               Germany
 31  18077         Mauritius, Mauritius       171.0             Mauritius
 32  18117                       Online         NaN                   NaN
 33  18128          Zurich, Switzerland        32.0           Switzerland
 34  18194              Porto, Portugal        28.0              Portugal
 35  18195      Cape Town, South Africa        17.0          South Africa
 36  18295             Toulouse, France        38.0                France

    country.abbrev  city.id        city.name    city.keyword  state.id  \
 0              AU  31174.0        Melbourne       melbourne       NaN
 1              MA  31119.0       Casablanca      casablanca       NaN
 2              AR  31171.0     Buenos Aires    buenos-aires       NaN
 3              BE  31125.0         Brussels        brussels       NaN
 4              MX  31175.0      Mexico City     mexico-city       NaN
 5              NL  31168.0        Amsterdam       amsterdam       NaN
 6              BR  31121.0        Sao Paulo       sao-paulo       NaN
 7              ES  31170.0        Barcelona       barcelona       NaN
 8              FR  31124.0         Bordeaux        bordeaux       NaN
 9              FR  31128.0            Lille           lille       NaN
 10             PT  31075.0           Lisbon          lisbon       NaN
 11             ID  31169.0             Bali            bali       NaN
 12             FR  31130.0           Nantes          nantes       NaN
 13             BR  31131.0  Rio de Janeiro   rio-de-janeiro       NaN
 14             FR  31129.0        Marseille       marseille       NaN
 15             CA  31135.0         Montreal        montreal       NaN
 16             CN  31108.0         Shanghai        shanghai       NaN
 17             JP  31132.0            Tokyo           tokyo       NaN
 18             FR  31106.0             Lyon            lyon       NaN
 19             DE  31156.0           Berlin          berlin       NaN
 20             FR  31136.0            Paris           paris       NaN
 21             CH  31163.0         Lausanne        lausanne       NaN
 22             ES  31052.0           Madrid          madrid       NaN
 23             FR  31147.0           Rennes          rennes       NaN
 24             SG  31154.0        Singapore       singapore       NaN
 25             GB  31176.0           London          london       NaN
 26             AE  31093.0            Dubai           dubai       NaN
 27             DE  31158.0           Munich          munich       NaN
 28             CL  31067.0         Santiago        santiago       NaN
 29             FR  31239.0             Nice            nice       NaN
 30             DE  31254.0          Cologne         cologne       NaN
 31             MU  31246.0        Mauritius       mauritius       NaN
 32            NaN      NaN              NaN             NaN       1.0
 33             CH  31082.0           Zurich          zurich       NaN
 34             PT  31102.0            Porto           porto       NaN
 35             ZA  31100.0        Cape Town       cape-town       NaN
 36             FR  31191.0         Toulouse        toulouse       NaN

    state.name state.abbrev state.keyword    school  school_id
 0         NaN          NaN           NaN  le-wagon      10868
 1         NaN          NaN           NaN  le-wagon      10868
 2         NaN          NaN           NaN  le-wagon      10868
 3         NaN          NaN           NaN  le-wagon      10868
 4         NaN          NaN           NaN  le-wagon      10868
 5         NaN          NaN           NaN  le-wagon      10868
 6         NaN          NaN           NaN  le-wagon      10868
 7         NaN          NaN           NaN  le-wagon      10868
 8         NaN          NaN           NaN  le-wagon      10868
 9         NaN          NaN           NaN  le-wagon      10868
 10        NaN          NaN           NaN  le-wagon      10868
 11        NaN          NaN           NaN  le-wagon      10868
 12        NaN          NaN           NaN  le-wagon      10868
 13        NaN          NaN           NaN  le-wagon      10868
 14        NaN          NaN           NaN  le-wagon      10868
 15        NaN          NaN           NaN  le-wagon      10868
 16        NaN          NaN           NaN  le-wagon      10868
 17        NaN          NaN           NaN  le-wagon      10868
 18        NaN          NaN           NaN  le-wagon      10868
 19        NaN          NaN           NaN  le-wagon      10868
 20        NaN          NaN           NaN  le-wagon      10868
 21        NaN          NaN           NaN  le-wagon      10868
 22        NaN          NaN           NaN  le-wagon      10868
 23        NaN          NaN           NaN  le-wagon      10868
 24        NaN          NaN           NaN  le-wagon      10868
 25        NaN          NaN           NaN  le-wagon      10868
 26        NaN          NaN           NaN  le-wagon      10868
 27        NaN          NaN           NaN  le-wagon      10868
 28        NaN          NaN           NaN  le-wagon      10868
 29        NaN          NaN           NaN  le-wagon      10868
 30        NaN          NaN           NaN  le-wagon      10868
 31        NaN          NaN           NaN  le-wagon      10868
 32     Online       Online        online  le-wagon      10868
 33        NaN          NaN           NaN  le-wagon      10868
 34        NaN          NaN           NaN  le-wagon      10868
 35        NaN          NaN           NaN  le-wagon      10868
 36        NaN          NaN           NaN  le-wagon      10868  ,
        id             description  country.id country.name country.abbrev  \
 0   16809           Paris, France        38.0       France             FR
 1   16811       Brussels, Belgium        46.0      Belgium             BE
 2   16813         Berlin, Germany        57.0      Germany             DE
 3   16814        La Loupe, France        38.0       France             FR
 4   16815      Bucharest, Romania         4.0      Romania             RO
 5   16816           Lille, France        38.0       France             FR
 6   16817            Lyon, France        38.0       France             FR
 7   16819       Marseille, France        38.0       France             FR
 8   17132        Biarritz, France        38.0       France             FR
 9   17133        Bordeaux, France        38.0       France             FR
 10  17134          Nantes, France        38.0       France             FR
 11  17135         OrlÃ©ans, France        38.0       France             FR
 12  17136           Reims, France        38.0       France             FR
 13  17137      Strasbourg, France        38.0       France             FR
 14  17138        Toulouse, France        38.0       France             FR
 15  17139           Tours, France        38.0       France             FR
 16  17140       Budapest, Hungary        21.0      Hungary             HU
 17  17141         Dublin, Ireland        25.0      Ireland             IE
 18  17142        Lisbon, Portugal        28.0     Portugal             PT
 19  17143         London, England        61.0      England             GB
 20  17144           Madrid, Spain        12.0        Spain             ES
 21  17145            Milan, Italy        39.0        Italy             IT
 22  17146  Amsterdam, Netherlands        59.0  Netherlands             NL
 23  17147        Barcelona, Spain        12.0        Spain             ES
 24  17472                  Online         NaN          NaN            NaN
 25  17473      Bruxelles, Belgium        46.0      Belgium             BE

     city.id   city.name city.keyword  state.id state.name state.abbrev  \
 0   31136.0       Paris        paris       NaN        NaN          NaN
 1   31125.0    Brussels     brussels       NaN        NaN          NaN
 2   31156.0      Berlin       berlin       NaN        NaN          NaN
 3   31187.0    La Loupe     la-loupe       NaN        NaN          NaN
 4   31040.0   Bucharest    bucharest       NaN        NaN          NaN
 5   31128.0       Lille        lille       NaN        NaN          NaN
 6   31106.0        Lyon         lyon       NaN        NaN          NaN
 7   31129.0   Marseille    marseille       NaN        NaN          NaN
 8   31186.0    Biarritz     biarritz       NaN        NaN          NaN
 9   31124.0    Bordeaux     bordeaux       NaN        NaN          NaN
 10  31130.0      Nantes       nantes       NaN        NaN          NaN
 11  31188.0     OrlÃ©ans      orleans       NaN        NaN          NaN
 12  31189.0       Reims        reims       NaN        NaN          NaN
 13  31190.0  Strasbourg   strasbourg       NaN        NaN          NaN
 14  31191.0    Toulouse     toulouse       NaN        NaN          NaN
 15  31192.0       Tours        tours       NaN        NaN          NaN
 16  31066.0    Budapest     budapest       NaN        NaN          NaN
 17  31099.0      Dublin       dublin       NaN        NaN          NaN
 18  31075.0      Lisbon       lisbon       NaN        NaN          NaN
 19  31176.0      London       london       NaN        NaN          NaN
 20  31052.0      Madrid       madrid       NaN        NaN          NaN
 21  31107.0       Milan        milan       NaN        NaN          NaN
 22  31168.0   Amsterdam    amsterdam       NaN        NaN          NaN
 23  31170.0   Barcelona    barcelona       NaN        NaN          NaN
 24      NaN         NaN          NaN       1.0     Online       Online
 25  31241.0   Bruxelles    bruxelles       NaN        NaN          NaN

    state.keyword            school  school_id
 0            NaN  wild-code-school      11169
 1            NaN  wild-code-school      11169
 2            NaN  wild-code-school      11169
 3            NaN  wild-code-school      11169
 4            NaN  wild-code-school      11169
 5            NaN  wild-code-school      11169
 6            NaN  wild-code-school      11169
 7            NaN  wild-code-school      11169
 8            NaN  wild-code-school      11169
 9            NaN  wild-code-school      11169
 10           NaN  wild-code-school      11169
 11           NaN  wild-code-school      11169
 12           NaN  wild-code-school      11169
 13           NaN  wild-code-school      11169
 14           NaN  wild-code-school      11169
 15           NaN  wild-code-school      11169
 16           NaN  wild-code-school      11169
 17           NaN  wild-code-school      11169
 18           NaN  wild-code-school      11169
 19           NaN  wild-code-school      11169
 20           NaN  wild-code-school      11169
 21           NaN  wild-code-school      11169
 22           NaN  wild-code-school      11169
 23           NaN  wild-code-school      11169
 24        online  wild-code-school      11169
 25           NaN  wild-code-school      11169  ,
       id                      description  country.id   country.name  \
 0  16040  Santa Monica, CA, United States           1  United States
 1  16059   Los Angeles, CA, United States           1  United States
 2  16985        Irvine, CA, United States           1  United States
 3  17159   Playa Vista, CA, United States           1  United States
 4  17160     San Diego, CA, United States           1  United States
 5  17161  Walnut Creek, CA, United States           1  United States
 6  17162         Lacey, WA, United States           1  United States

   country.abbrev  state.id  state.name state.abbrev state.keyword  city.id  \
 0             US         6  California           CA    california     1526
 1             US         6  California           CA    california       10
 2             US         6  California           CA    california       24
 3             US         6  California           CA    california    29047
 4             US         6  California           CA    california       11
 5             US         6  California           CA    california     1752

In [477]:
locations = pd.concat(locations_list)
locations.head(2)

,id,description,country.id,country.name,country.abbrev,state.id,state.name,state.abbrev,state.keyword,city.id,city.name,city.keyword,school,school_id
0,15743,"New York City, NY",1.0,United States,US,34.0,New York,NY,new-york,1507.0,NYC,new-york-city,flatiron-school,10748
1,16257,Online,NaN,NaN,NaN,1.0,Online,Online,online,NaN,NaN,NaN,flatiron-school,10748

In [478]:
locations.drop(['description', 'country.abbrev', 'state.abbrev', 'state.keyword', 'city.keyword'], axis = 1, inplace = True, errors = "ignore")

In [479]:
locations.head(2)

,id,country.id,country.name,state.id,state.name,city.id,city.name,school,school_id
0,15743,1.0,United States,34.0,New York,1507.0,NYC,flatiron-school,10748
1,16257,NaN,NaN,1.0,Online,NaN,NaN,flatiron-school,10748

In [481]:
locations.rename(columns = {'id' : 'location_id', 'country_id' : 'country_id', "country.name" : "country_name", 'state.id' : 'state_id', 'state.name' : 'state_name', 'city.id' : 'city_id', 'city.name' : 'city_name'}, inplace = True)

In [482]:
locations.to_csv('locations.csv')
locations.to_sql('locations', engine, if_exists = 'replace', index = False)
locations

,location_id,country.id,country_name,state_id,state_name,city_id,city_name,school,school_id
0,15743,1.0,United States,34.0,New York,1507.0,NYC,flatiron-school,10748
1,16257,NaN,NaN,1.0,Online,NaN,NaN,flatiron-school,10748
2,16761,1.0,United States,7.0,Colorado,27.0,Denver,flatiron-school,10748
3,16958,11.0,United Kingdom,NaN,NaN,31176.0,London,flatiron-school,10748
0,16360,1.0,United States,34.0,New York,1507.0,NYC,general-assembly,10761
...,...,...,...,...,...,...,...,...,...
3,16909,1.0,United States,23.0,Massachusetts,47.0,Boston,brainstation,10571
4,16910,1.0,United States,15.0,Illinois,39.0,Chicago,brainstation,10571
5,16940,NaN,NaN,1.0,Online,NaN,NaN,brainstation,10571
6,17706,1.0,United States,11.0,Florida,31.0,Miami,brainstation,10571
7,17731,11.0,United Kingdom,NaN,NaN,31176.0,London,brainstation,10571

In [484]:
courses = pd.concat(courses_list)
courses.head(10)

,courses,school,school_id
0,Cybersecurity Engineering,flatiron-school,10748
1,Data Science,flatiron-school,10748
2,Product Design (UX/UI),flatiron-school,10748
3,Software Engineering,flatiron-school,10748
4,Flatiron Schoolâ€™s â€˜Intro to Product Designâ€™ le...,flatiron-school,10748
5,Flatiron Schoolâ€™s Learn Cybersecurity for Free...,flatiron-school,10748
6,Flatiron Schoolâ€™s Learn Data Science for Free....,flatiron-school,10748
7,Flatiron Schoolâ€™s Learn to Code for Free. Sign up,flatiron-school,10748
8,Online Cybersecurity Engineering,flatiron-school,10748
9,Online Data Science,flatiron-school,10748

In [486]:
badges = pd.concat(badges_list)

In [496]:
badges.head()

,name,keyword,description,school,school_id
0,Available Online,available_online,<p>School offers fully online courses</p>,flatiron-school,10748
1,Verified Outcomes,verified_outcomes,<p>School publishes a third-party verified out...,flatiron-school,10748
2,Flexible Classes,flexible_classes,<p>School offers part-time and evening classes...,flatiron-school,10748
3,Accepts GI Bill,accepts_gi_bill,<p>School accepts the GI Bill</p>,flatiron-school,10748
0,Available Online,available_online,<p>School offers fully online courses</p>,general-assembly,10761

In [497]:
badges['detail'] =  badges['description'].apply(remove_tags)

NameError: name 'remove_tags' is not defined

In [290]:
# any data cleaning still missing here? take a look at the description
schools = pd.concat(schools_list)
schools.head(15)

,website,description,LogoUrl,school,school_id
0,flatironschool.com/?utm_campaign=FIS%20Partner...,"<span class=""truncatable""><p>Founded in 2012 a...",https://d92mrp7hetgfk.cloudfront.net/images/si...,flatiron-school,10748
0,generalassemb.ly?utm_source=switchup&utm_mediu...,"<span class=""truncatable""><p>General Assembly ...",https://d92mrp7hetgfk.cloudfront.net/images/si...,general-assembly,10761
0,datasciencedojo.com/data-science-bootcamp,"<span class=""truncatable""><p>Data Science Dojo...",https://d92mrp7hetgfk.cloudfront.net/images/si...,data-science-dojo,10685
0,www.ironhack.com/en,"<span class=""truncatable""><p>Ironhack is a glo...",https://d92mrp7hetgfk.cloudfront.net/images/si...,ironhack,10828
0,www.lewagon.com,"<span class=""truncatable""><p>Le Wagon is a glo...",https://d92mrp7hetgfk.cloudfront.net/images/si...,le-wagon,10868
0,wildcodeschool.com,"<span class=""truncatable""><p>Wild Code School ...",https://d92mrp7hetgfk.cloudfront.net/images/si...,wild-code-school,11169
0,www.thedevmasters.com,"<span class=""truncatable""><p>The goal of theDe...",https://d92mrp7hetgfk.cloudfront.net/images/si...,the-dev-masters,11077
0,byteacademy.co,"<span class=""truncatable""><p>Byte Academy is a...",https://d92mrp7hetgfk.cloudfront.net/images/si...,byte-academy,10574
0,www.thedataincubator.com,"<span class=""truncatable""><p>The Data Incubato...",https://d92mrp7hetgfk.cloudfront.net/images/si...,the-data-incubator,11074
0,brainstation.io,"<span class=""truncatable""><p>BrainStation is t...",https://d92mrp7hetgfk.cloudfront.net/images/si...,brainstation,10571

In [300]:
courses.to_csv("course.csv")

In [302]:
course = 'course'
courses.to_sql(course, engine, if_exists = 'replace', index = False)

84

In [303]:
badges.to_csv("badges.csv")

In [304]:
badges.to_sql('badges', engine, if_exists = 'replace', index = False)

25

In [305]:
schools.to_csv("schools.csv")

In [306]:
schools.to_sql('schools', engine, if_exists = 'replace', index = False)

10